Revit 2024 API
ParameterTypeId.ProfileParamAlongPath Property
 "Parameter along path"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ProfileParamAlongPath { get; }
Visual Basic
Public Shared ReadOnly Property ProfileParamAlongPath As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ProfileParamAlongPath {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace